module plugin.constant;
import plugin.constant;

enum EU4Ver
    {
     UNKNOWN = 0,
     v1_25_X = 125,
     v1_26_X = 126,
     v1_27_X = 127,
     v1_28_X = 128,
     v1_28_3 = 1283,
     v1_29_0_0 = 12900, // 追加
     v1_29_1_0 = 12910, // 追加
     v1_29_2_0 = 12920, // 追加
     v1_29_3_0 = 12930,
     v1_29_4_0 = 12940,
     v1_30_1_0 = 13010,
     v1_30_2_0 = 13020,
     v1_30_3_0 = 13030,
     v1_30_4_0 = 13040,
     v1_30_5_0 = 13050,
     v1_31_1_0 = 13110,
     v1_31_2_0 = 13120,
     v1_31_3_0 = 13130,
     v1_31_4_0 = 13140,
     v1_31_5_0 = 13150,
     v1_31_6_0 = 13160,
     v1_32_0_1 = 13201,
     v1_33_0_0 = 13300,
     v1_33_3_0 = 13330
    }

public struct RunOptions {
    EU4Ver eu4Version;
    ubyte separateCharacterCodePoint; // 追加
}
